app/Controllers/Backend/Forgot.php

    public function index()
    {
        if($this->request->is("post")){

            $data = [
              'email' => $this->request->getPost('email')
            ];

            if(!$this->validation->run($data, 'forgot')){
                $this->session->setFlashdata(['errors' => $this->validation->getErrors()]);
                return redirect()->to(route_to('admin_forgot_password'));
            }

            $user = $this->userModel->where('email',$data['email'])->first();
---
SELECT *
FROM `users`
WHERE `email` = 'ibrahimberk076@gmail.com'
AND `users`.`deleted_at` IS NULL
 LIMIT 1

    public function resetPassword()
    {
        $tempData=$this->session->getTempdata("userId");
        if($tempData){
            if($this->request->is("post")){
                $data = [
                    'password' => $this->request->getPost('password'),
                    'password2' => $this->request->getPost('password2')
                  ];
                  if(!$this->validation->run($data, 'resetPassword')){
                    $this->session->setFlashdata(['errors' => $this->validation->getErrors()]);
                    return redirect()->to(route_to('admin_reset_password'));
                }
                $this->userEntity->setVerifyKey();
                $this->userEntity->setPassword($data["password"]);
                $update=$this->userModel->update($tempData,$this->userEntity);
---
UPDATE `users` SET `verify_key` = 'QtGsGDtgPEnZdbAtGMrWHPLLxoAgoBBXqNomQLVmFNyjrOBXtSDDuLrQecXLllxD', `password` = '$2y$10$K5FJVcMmoYfSx.dIqwgk6.oYJ5n/zzN/yHnJrjv7afIRHrKl8KxlO', `updated_at` = '2024-06-19 20:18:53'
WHERE `users`.`id` IN ('128')