app/Controllers/Backend/Login.php

SELECT *
FROM `users`
WHERE `email` = 'ibrahimberk076@gmail.com'
AND `users`.`deleted_at` IS NULL
 LIMIT 1
---
    public function index(){
        if($this->request->is("post")){

            $data = [
              'email' => $this->request->getPost('email'),
              'password' => $this->request->getPost('password')
            ];
            if(!$this->validation->run($data, 'login')){
                $this->session->setFlashdata(['errors' => $this->validation->getErrors()]);
                return redirect()->to(route_to('admin_login'));
            }
            $user = $this->userModel->where('email',$data['email'])->first();