app/Controllers/Backend/Verification.php

    public function account($token){
        $explode=explode(".",$token);
        $userId=$explode[0];
        $verifyKey=$explode[1];
       $user= $this->userModel->where([
            "id"=>$userId,
            "verify_key"=>$verifyKey,
            "status"=>USER_PENDING
        ])->first();
---
SELECT *
FROM `users`
WHERE `id` = '128'
AND `verify_key` = 'vBzBaYDfIFFpzAeIVfyeUZNcHwDbgKgjXTunVeFUNZpyXjKgBUsjcPlsUhLWQZiW'
AND `status` = 'PENDING'
AND `users`.`deleted_at` IS NULL
 LIMIT 1

public function forgot($token){

 $explode=explode(".",$token);
        $userId=$explode[0];
        $verifyKey=$explode[1];
       $user= $this->userModel->where([
            "id"=>$userId,
            "verify_key"=>$verifyKey,

        ])->first();
        if(!$user){
            return view("admin/pages/verify/password-error");
        }


        $this->userEntity->setVerifyKey();
        $update=$this->userModel->update($userId,$this->userEntity);
---
SELECT *
FROM `users`
WHERE `id` = '128'
AND `verify_key` = 'vBzBaYDfIFFpzAeIVfyeUZNcHwDbgKgjXTunVeFUNZpyXjKgBUsjcPlsUhLWQZiW'
AND `users`.`deleted_at` IS NULL
 LIMIT 1
UPDATE `users` SET `verify_key` = 'LxcGGiiVfDhdJaKWDmoTqvCkFEYlzFFiXUKHXLAvJgPiSudJKNYzgEGmgEQYLAGn', `updated_at` = '2024-06-19 01:51:54'
WHERE `users`.`id` IN ('128')