app/Controllers/Home.php

SELECT *
FROM `users`
WHERE `users`.`deleted_at` IS NULL
AND `users`.`id` = 15
---
    public function index()
    {
        $model=new UserModel();
        $user = $model->find(15);